mohammedshahin10/CH32V203_HAPPY-BELL/Firmware/LibHelixMP3/ch32_mp3_player.c
#include "ch32_mp3_player.h"
#include "ch32v20x.h"
#include "ff.h"
#include "mp3dec.h"
#include "assembly.h"
#include <string.h>
#include "happybell_build.h"
#include "ch32v20x_it.h"

#if HAPPYBELL_BUILD_PROFILE == HAPPYBELL_PROFILE_FULL
#include "player.h"
#define Audio_WaitOneMs() Player_AudioWaitOneMs()
#else
#include "debug.h"
#define Audio_WaitOneMs() Delay_Ms(1U)
#endif

/*
 * ------------------------------------------------------------------------
 * DMA-driven audio output (PA8/TIM1_CH1 PWM carrier -> external LPF -> AUX_OUT)
 * ------------------------------------------------------------------------
 *
 * TIM1_CH1 still generates the fixed 8-bit PWM carrier (ARR 255, nominally
 * 375 kHz at a 96 MHz timer clock) that feeds the schematic AUX net and the
 * board's analog low-pass filter stage to AUX_OUT, exactly as before.
 *
 * TIM2 still free-runs at the decoded sample rate (see Audio_Init()), but
 * instead of firing a per-sample CPU interrupt it now issues a DMA request
 * on every update event. DMA1 Channel2 moves each prepared sample directly
 * from a decoded PCM slot into TIM1->CH1CVR with no CPU involvement per
 * sample; the CPU is only interrupted once per 576-sample slot (DMA
 * Transfer-Complete), to hand off to the next ready slot or fall back to a
 * small circularly-looped silence buffer so the carrier never stalls.
 *
 * Volume scaling and the 0..255 PWM-duty bias that used to run per-sample
 * inside the old TIM2 ISR now run once per decoded granule, in
 * Audio_PrepareSlot(), before that row is marked ready for DMA. All deployed
 * audio receives bounded peak-aware gain, with immediate gain reduction and a
 * gradual interpolated rise so quiet assets become louder without wraparound.
 *
 * WCH's CH32FV2x/V3x reference manual DMA request table confirms TIM2_UP on
 * DMA1 Channel2. That channel also carries SPI1_RX and TIM1_CH1, so it must
 * not be reassigned to an SD-card SPI DMA path without re-checking ownership.
 */

#define INPUT_BUFFER_SIZE       768U
#define INPUT_REFILL_LEVEL      (INPUT_BUFFER_SIZE - 95U)
#define PCM_SAMPLES_PER_SLOT    576U
#define NO_SLOT                 0xffU
#define SILENCE_LEN             32U   /* small circular fill while no slot is ready */
#define PWM_MID                 128U  /* silence / idle duty (8-bit PWM midpoint) */
#define DMA_WAIT_TIMEOUT_MS     500U
#define AUDIO_TIMER_CLOCK_HZ    96000000U
#define MAX_CONSECUTIVE_BAD_FRAMES 8U
#define AUDIO_GAIN_MIN_Q8       254U  /* attenuates full-scale PCM below PWM rails */
#define AUDIO_GAIN_MAX_Q8       8192U /* 32x / +30 dB for very quiet source material */
#define AUDIO_GAIN_RISE_Q8      256U  /* +1x/block recovery, interpolated across samples */
#define AUDIO_GAIN_TARGET       32512U /* 99.2% PCM scale; duty remains within 1..254 */
#define AUDIO_GAIN_MIN_PEAK     512U  /* do not chase digital silence/background noise */

static unsigned char inputBuffer[INPUT_BUFFER_SIZE];
/* Holds raw decoded PCM until Audio_PrepareSlot() converts it in place to
 * ready-to-DMA 0..255 PWM-duty values (same buffer, no extra RAM). */
static short pcmBuffer[2U * PCM_SAMPLES_PER_SLOT];
static short silenceSample;
static volatile uint16_t slotCount[2];
static volatile uint8_t slotState[2]; /* 0 free, 1 ready, 2 playing */
static volatile uint8_t playingSlot = NO_SLOT;
static volatile uint8_t silenceActive;
static volatile uint8_t outputVolume;
static volatile uint32_t underflowCount;
static volatile uint16_t decodedPeak;
static volatile uint16_t completedDMASlots;
static volatile uint8_t gapAfterPlayback;
static volatile uint8_t stopRequest;
static volatile uint32_t sampleClockBaseTicks;
static volatile uint32_t sampleClockRemainder;
static volatile uint32_t sampleClockDivisor;
static volatile uint32_t sampleClockAccumulator;
static CH32_MP3_StreamInfo streamInfo;
static uint16_t audioGainQ8;

/* .enc is the complete MP3 file XORed from byte zero with this repeating key.
 * There is no IV or wrapper header. Use the absolute file offset for the key
 * phase so seeks and partial FatFs reads cannot desynchronize decryption. */
static const uint8_t xorKey[4]
    __attribute__((section(".rodata.mp3_xor_key"))) = { 'B', 'K', '2', '6' };

static void DecryptBuffer(uint8_t *data, uint32_t len, FSIZE_t fileOffset)
{
    uint32_t i;
    for (i = 0; i < len; i++) {
        data[i] ^= xorKey[((uint32_t)fileOffset + i) & 3U];
    }
}

static uint8_t IsEncryptedPath(const char *path)
{
    const char *ext = strrchr(path, '.');

    if (!ext || ext[1] == '\0' || ext[2] == '\0' || ext[3] == '\0' ||
        ext[4] != '\0')
        return 0;
    return (ext[1] == 'e' || ext[1] == 'E') &&
           (ext[2] == 'n' || ext[2] == 'N') &&
           (ext[3] == 'c' || ext[3] == 'C');
}

static uint8_t HasLayer3Header(const uint8_t *data, uint32_t len)
{
    uint8_t version;
    uint8_t layer;
    uint8_t bitrate;
    uint8_t sampleRate;

    if (!data || len < 4U || data[0] != 0xffU || (data[1] & 0xe0U) != 0xe0U)
        return 0;
    version = (data[1] >> 3) & 3U;
    layer = (data[1] >> 1) & 3U;
    bitrate = data[2] >> 4;
    sampleRate = (data[2] >> 2) & 3U;
    return version == 3U && layer == 1U &&
           (bitrate == 5U || bitrate == 9U) && sampleRate == 2U &&
           ((data[3] >> 6) & 3U) == 3U;
}

/* Validate the decrypted preamble and skip ID3v2 before streaming. The
 * encrypted files on the mounted card carry a normal ID3v2.4 tag inside the
 * XOR stream, followed directly by MPEG Layer III frames. */
static CH32_MP3_Status PrepareAudioFile(FIL *file, uint8_t encrypted)
{
    UINT bytesRead;
    FRESULT readResult;
    FSIZE_t tagEnd;
    FSIZE_t audioStart = 0;
    uint8_t index;
    uint8_t id3Found = 0;

    if (f_lseek(file, 0) != FR_OK)
        return CH32_MP3_SD_READ_ERROR;
    readResult = f_read(file, inputBuffer, 10U, &bytesRead);
    if (readResult != FR_OK)
        return CH32_MP3_SD_READ_ERROR;
    if (bytesRead < 4U)
        return encrypted ? CH32_MP3_DECRYPT_ERROR : CH32_MP3_CORRUPT_FILE;
    if (encrypted)
        DecryptBuffer(inputBuffer, bytesRead, 0U);

    if (bytesRead == 10 && inputBuffer[0] == 'I' && inputBuffer[1] == 'D' &&
        inputBuffer[2] == '3') {
        id3Found = 1;
        for (index = 6U; index < 10U; index++) {
            if (inputBuffer[index] & 0x80U)
                return CH32_MP3_CORRUPT_FILE;
        }
        tagEnd = 10U +
            ((FSIZE_t)(inputBuffer[6] & 0x7fU) << 21) +
            ((FSIZE_t)(inputBuffer[7] & 0x7fU) << 14) +
            ((FSIZE_t)(inputBuffer[8] & 0x7fU) << 7) +
            (FSIZE_t)(inputBuffer[9] & 0x7fU);
        if (inputBuffer[5] & 0x10U)
            tagEnd += 10U;
        if (tagEnd > f_size(file))
            return CH32_MP3_CORRUPT_FILE;
        audioStart = tagEnd;
    } else if (encrypted && !HasLayer3Header(inputBuffer, bytesRead)) {
        return CH32_MP3_DECRYPT_ERROR;
    }

    if (f_lseek(file, audioStart) != FR_OK)
        return CH32_MP3_SD_READ_ERROR;
    if (encrypted || id3Found) {
        readResult = f_read(file, inputBuffer, 4U, &bytesRead);
        if (readResult != FR_OK)
            return CH32_MP3_SD_READ_ERROR;
        if (bytesRead != 4U)
            return CH32_MP3_CORRUPT_FILE;
        if (encrypted)
            DecryptBuffer(inputBuffer, bytesRead, audioStart);
        if (!HasLayer3Header(inputBuffer, bytesRead))
            return id3Found ? CH32_MP3_UNSUPPORTED_FORMAT :
                   CH32_MP3_DECRYPT_ERROR;
    }
    return f_lseek(file, audioStart) == FR_OK ?
           CH32_MP3_OK : CH32_MP3_SD_READ_ERROR;
}

