mohammedshahin10/CH32V203_HAPPY-BELL/Firmware/LibHelixMP3/ch32_mp3_player.c
static uint16_t Layer3FrameBytes(const MP3FrameInfo *info,
                                 const uint8_t *header)
{
    uint32_t bytes;
    if (!info || !header ||
        (info->bitrate != 64000 && info->bitrate != 128000))
        return 0;
    bytes = (144U * (uint32_t)info->bitrate) / 32000U;
    bytes += (header[2] >> 1) & 1U;
    return bytes <= 0xffffU ? (uint16_t)bytes : 0U;
}

typedef enum {
    AUDIO_INIT_OK = 0,
    AUDIO_INIT_UNSUPPORTED_RATE,
    AUDIO_INIT_CLOCK_ERROR
} Audio_InitStatus;

static void DMA_StartSilence(void)
{
    if (silenceActive)
        return; /* already looping on silence; nothing to reprogram */

    DMA_Cmd(DMA1_Channel2, DISABLE);
    DMA1_Channel2->MADDR = (uint32_t)&silenceSample;
    DMA1_Channel2->CNTR = SILENCE_LEN;
    DMA1_Channel2->CFGR = (DMA1_Channel2->CFGR | DMA_Mode_Circular) &
                          ~DMA_MemoryInc_Enable;
    playingSlot = NO_SLOT;
    silenceActive = 1;
    DMA_Cmd(DMA1_Channel2, ENABLE);
}

static void DMA_StartSlot(uint8_t slot)
{
    DMA_Cmd(DMA1_Channel2, DISABLE);
    DMA1_Channel2->MADDR =
        (uint32_t)&pcmBuffer[(uint16_t)slot * PCM_SAMPLES_PER_SLOT];
    DMA1_Channel2->CNTR = slotCount[slot];
    DMA1_Channel2->CFGR = (DMA1_Channel2->CFGR & ~DMA_Mode_Circular) |
                          DMA_MemoryInc_Enable; /* one-shot: TC fires at slot end */
    slotState[slot] = 2;
    playingSlot = slot;
    silenceActive = 0;
    DMA_Cmd(DMA1_Channel2, ENABLE);
}

/* Arms the next ready slot, or falls back to silence. Only takes effect
 * while the carrier is idle (playingSlot == NO_SLOT) -- while a real slot
 * is playing, the DMA Transfer-Complete interrupt is what calls this next.
 * cameFromRealSlot marks a fresh underflow (gapAfterPlayback) only when a
 * real slot just finished and nothing else was ready in time; it must NOT
 * be set on every completion, or a normal back-to-back handoff between two
 * already-ready slots would be miscounted as an underflow. */
static void Audio_StartReadySlot(uint8_t cameFromRealSlot)
{
    uint8_t slot;

    if (playingSlot != NO_SLOT)
        return;

    for (slot = 0; slot < 2; slot++) {
        if (slotState[slot] == 1) {
            if (gapAfterPlayback) {
                underflowCount++;
                gapAfterPlayback = 0;
            }
            DMA_StartSlot(slot);
            return;
        }
    }

    if (cameFromRealSlot)
        gapAfterPlayback = 1;
    DMA_StartSilence();
}

/* A loud slot reduces gain before it is handed to DMA, while quiet slots raise
 * gain gradually. Starting at the ceiling is safe because the complete slot is
 * peak-scanned before any sample reaches DMA. With the 32x Q8 ceiling, the
 * worst intermediate magnitude is 32768 * 8192 = 268,435,456, safely inside
 * int32_t. Final saturation remains a hard guard against corrupt PCM or
 * arithmetic edge cases. */
static void Audio_PrepareSlot(uint8_t slot, uint16_t count)
{
    uint16_t i;
    uint16_t blockPeak = 0U;
    uint16_t desiredGainQ8;
    uint16_t nextGainQ8;
    uint16_t startGainQ8;
    uint16_t endGainQ8;
    uint16_t gainQ8;
    uint32_t gainAccumulatorQ16;
    uint32_t gainStepQ16 = 0U;
    int32_t s;
    int32_t magnitude;

    for (i = 0; i < count; i++) {
        s = pcmBuffer[(uint16_t)slot * PCM_SAMPLES_PER_SLOT + i];
        magnitude = (s < 0) ? -s : s;
        if ((uint32_t)magnitude > blockPeak)
            blockPeak = (uint16_t)magnitude;
        if ((uint32_t)magnitude > decodedPeak)
            decodedPeak = (uint16_t)magnitude;
    }

    startGainQ8 = audioGainQ8;
    if (blockPeak >= AUDIO_GAIN_MIN_PEAK) {
        desiredGainQ8 = (uint16_t)(((uint32_t)AUDIO_GAIN_TARGET << 8) /
                                  blockPeak);
        if (desiredGainQ8 < AUDIO_GAIN_MIN_Q8)
            desiredGainQ8 = AUDIO_GAIN_MIN_Q8;
        else if (desiredGainQ8 > AUDIO_GAIN_MAX_Q8)
            desiredGainQ8 = AUDIO_GAIN_MAX_Q8;

        if (desiredGainQ8 <= audioGainQ8) {
            audioGainQ8 = desiredGainQ8;
            startGainQ8 = desiredGainQ8;
        } else {
            nextGainQ8 = audioGainQ8 + AUDIO_GAIN_RISE_Q8;
            audioGainQ8 = (nextGainQ8 < desiredGainQ8) ?
                          nextGainQ8 : desiredGainQ8;
        }
    }
    endGainQ8 = audioGainQ8;
    if (endGainQ8 > startGainQ8 && count != 0U)
        gainStepQ16 = ((uint32_t)(endGainQ8 - startGainQ8) << 16) /
                      count;
    gainAccumulatorQ16 = (uint32_t)startGainQ8 << 16;

    for (i = 0; i < count; i++) {
        s = pcmBuffer[(uint16_t)slot * PCM_SAMPLES_PER_SLOT + i];
        gainQ8 = (uint16_t)(gainAccumulatorQ16 >> 16);
        s = (s * (int32_t)gainQ8) >> 8;
        s = (s * (int32_t)outputVolume) >> 16;
        if (s > 127)
            s = 127;
        else if (s < -128)
            s = -128;
        pcmBuffer[(uint16_t)slot * PCM_SAMPLES_PER_SLOT + i] =
            (short)(s + (int32_t)PWM_MID);
        gainAccumulatorQ16 += gainStepQ16;
    }
}

static Audio_InitStatus Audio_Init(uint32_t sampleRate)
{
    GPIO_InitTypeDef gpio;
    TIM_TimeBaseInitTypeDef timer;
    TIM_OCInitTypeDef pwm;
    NVIC_InitTypeDef nvic;
    DMA_InitTypeDef dma;
    uint32_t samplePeriod;

    if (sampleRate < 8000U || sampleRate > 48000U)
        return AUDIO_INIT_UNSUPPORTED_RATE;
    if (SystemCoreClock != AUDIO_TIMER_CLOCK_HZ ||
        (RCC->CFGR0 & RCC_PPRE1) != RCC_PPRE1_DIV2)
        return AUDIO_INIT_CLOCK_ERROR;
    samplePeriod = AUDIO_TIMER_CLOCK_HZ / sampleRate;
    if (samplePeriod == 0U || samplePeriod > 65536U ||
        (samplePeriod == 65536U &&
         (AUDIO_TIMER_CLOCK_HZ % sampleRate) != 0U))
        return AUDIO_INIT_UNSUPPORTED_RATE;
    sampleClockBaseTicks = samplePeriod;
    sampleClockRemainder = AUDIO_TIMER_CLOCK_HZ % sampleRate;
    sampleClockDivisor = sampleRate;
    sampleClockAccumulator = 0U;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO |
                           RCC_APB2Periph_TIM1, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

