mohammedshahin10/CH32V203_HAPPY-BELL/Firmware/LibHelixMP3/ch32_mp3_player.c
    /* TIM1 is an advanced timer. TIM_OC1Init() consumes complementary-output
     * and idle-state members as well as the four main PWM members, so the
     * whole structure must be initialized deterministically. Reset all three
     * audio peripherals before each file playback. */
    TIM_DeInit(TIM1);
    TIM_DeInit(TIM2);
    DMA_DeInit(DMA1_Channel2);
    GPIO_PinRemapConfig(GPIO_FullRemap_TIM1, DISABLE);

    gpio.GPIO_Pin = GPIO_Pin_8; /* schematic AUX: PA8/TIM1_CH1 */
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &gpio);

    timer.TIM_Prescaler = 0;
    timer.TIM_CounterMode = TIM_CounterMode_Up;
    timer.TIM_Period = 255;     /* 375 kHz, 8-bit PWM at 96 MHz */
    timer.TIM_ClockDivision = TIM_CKD_DIV1;
    timer.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM1, &timer);

    TIM_OCStructInit(&pwm);
    pwm.TIM_OCMode = TIM_OCMode_PWM1;
    pwm.TIM_OutputState = TIM_OutputState_Enable;
    pwm.TIM_Pulse = PWM_MID;
    pwm.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OC1Init(TIM1, &pwm);
    TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_ARRPreloadConfig(TIM1, ENABLE);
    TIM_CtrlPWMOutputs(TIM1, ENABLE);
    TIM_Cmd(TIM1, ENABLE);

    timer.TIM_Period = (uint16_t)(samplePeriod - 1U);
    TIM_TimeBaseInit(TIM2, &timer);
    TIM_ARRPreloadConfig(TIM2, DISABLE);
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
    TIM_DMACmd(TIM2, TIM_DMA_Update, ENABLE);

    if (sampleClockRemainder != 0U) {
        nvic.NVIC_IRQChannel = TIM2_IRQn;
        nvic.NVIC_IRQChannelPreemptionPriority = 0;
        nvic.NVIC_IRQChannelSubPriority = 0;
        nvic.NVIC_IRQChannelCmd = ENABLE;
        NVIC_Init(&nvic);
        TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
    }

    silenceSample = (short)PWM_MID;

    dma.DMA_PeripheralBaseAddr = (uint32_t)&TIM1->CH1CVR;
    dma.DMA_MemoryBaseAddr = (uint32_t)&silenceSample;
    dma.DMA_DIR = DMA_DIR_PeripheralDST;
    dma.DMA_BufferSize = SILENCE_LEN;
    dma.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma.DMA_MemoryInc = DMA_MemoryInc_Disable;
    dma.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    dma.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    dma.DMA_Mode = DMA_Mode_Circular;
    dma.DMA_Priority = DMA_Priority_High;
    dma.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA1_Channel2, &dma);
    DMA_ITConfig(DMA1_Channel2, DMA_IT_TC, ENABLE);

    nvic.NVIC_IRQChannel = DMA1_Channel2_IRQn;
    nvic.NVIC_IRQChannelPreemptionPriority = 1;
    nvic.NVIC_IRQChannelSubPriority = 0;
    nvic.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&nvic);

    playingSlot = NO_SLOT;
    silenceActive = 1;
    DMA_Cmd(DMA1_Channel2, ENABLE);
    TIM_Cmd(TIM2, ENABLE);
    return AUDIO_INIT_OK;
}

/* MPEG-1 contains two 576-sample granules per frame. Queue each row as soon
 * as Helix synthesizes it so the following row can decode while DMA plays the
 * preceding one. This avoids a forced silence gap at every frame boundary and
 * uses the existing two contiguous rows instead of adding another RAM buffer. */
static int Audio_GranuleOutputHook(void *context, int granule, short *output,
                                  int outputSamps, int event)
{
    uint16_t waitMs;
    uint8_t slot;

    (void)context;
    if (granule < 0 || granule > 1 || outputSamps <= 0 ||
        outputSamps > (int)PCM_SAMPLES_PER_SLOT)
        return -1;
    slot = (uint8_t)granule;
    if (output != &pcmBuffer[(uint16_t)slot * PCM_SAMPLES_PER_SLOT])
        return -1;

    if (event == MP3_GRANULE_OUTPUT_BEFORE) {
        waitMs = 0;
        while (slotState[slot] != 0U && !stopRequest) {
            if (waitMs++ >= DMA_WAIT_TIMEOUT_MS)
                return -1;
            Audio_WaitOneMs();
        }
        return stopRequest ? -1 : 0;
    }
    if (event != MP3_GRANULE_OUTPUT_AFTER)
        return -1;

    FaultDiag_SetStage(FAULT_STAGE_PCM_PREPARE);
    Audio_PrepareSlot(slot, (uint16_t)outputSamps);
    slotCount[slot] = (uint16_t)outputSamps;
    slotState[slot] = 1;
    FaultDiag_SetStage(FAULT_STAGE_DMA_OUTPUT);
    Audio_StartReadySlot(0);
    return 0;
}

uint8_t CH32_MP3_ArithmeticSelfTest(void)
{
    const int a = -123456789;
    const int b = 987654321;

    if (MULSHIFT32(a, b) != -28389653)
        return 0;
    if (MADD64(0, a, b) != -121932631112635269LL)
        return 0;
    return 1;
}

/* Rates in the 44.1 kHz family do not divide the 96 MHz timer clock evenly.
 * Dither TIM2 between adjacent integer periods with a phase accumulator. The
 * long-term update rate is exact; 32/48 kHz-family assets have zero remainder
 * and never enable this per-sample interrupt. */
void TIM2_IRQHandler(void)
    __attribute__((interrupt("WCH-Interrupt-fast"), used, externally_visible));
void TIM2_IRQHandler(void)
{
    uint32_t ticks;

    if (TIM_GetITStatus(TIM2, TIM_IT_Update) == RESET)
        return;
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
    if (sampleClockRemainder == 0U)
        return;
    ticks = sampleClockBaseTicks;
    sampleClockAccumulator += sampleClockRemainder;
    if (sampleClockAccumulator >= sampleClockDivisor) {
        sampleClockAccumulator -= sampleClockDivisor;
        ticks++;
    }
    TIM2->ATRLR = (uint16_t)(ticks - 1U);
}

void DMA1_Channel2_IRQHandler(void)
    __attribute__((interrupt("WCH-Interrupt-fast"), used, externally_visible));
void DMA1_Channel2_IRQHandler(void)
{
    if (DMA_GetITStatus(DMA1_IT_TC2) == RESET)
        return;
    DMA_ClearITPendingBit(DMA1_IT_TC2);

    if (playingSlot != NO_SLOT) {
        /* A real slot just finished. If nothing else is ready,
         * Audio_StartReadySlot() falling through to silence counts as an
         * underflow (matches the previous ISR's gapAfterPlayback logic). */
        if (completedDMASlots != 0xffffU)
            completedDMASlots++;
        slotState[playingSlot] = 0;
        playingSlot = NO_SLOT;
        Audio_StartReadySlot(1);
        return;
    }

    /* Was already looping on silence (fires once per SILENCE_LEN-sample
     * wrap); check again for freshly-decoded data. No new gap here -- we
     * were already silent. */
    Audio_StartReadySlot(0);
}

