mohammedshahin10/CH32V203_HAPPY-BELL/Firmware/LibHelixMP3/ch32_mp3_player.c
void CH32_MP3_Stop(void)
{
    DMA_Cmd(DMA1_Channel2, DISABLE);
    TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
    TIM_DMACmd(TIM2, TIM_DMA_Update, DISABLE);
    TIM_Cmd(TIM2, DISABLE);
    TIM_SetCompare1(TIM1, PWM_MID);
    TIM_Cmd(TIM1, DISABLE);
    TIM_CtrlPWMOutputs(TIM1, DISABLE);
    playingSlot = NO_SLOT;
    silenceActive = 0;
    slotState[0] = slotState[1] = 0;
}

uint32_t CH32_MP3_GetUnderflowCount(void)
{
    return underflowCount;
}

uint16_t CH32_MP3_GetDecodedPeak(void)
{
    return decodedPeak;
}

uint16_t CH32_MP3_GetCompletedDMASlots(void)
{
    return completedDMASlots;
}

void CH32_MP3_GetStreamInfo(CH32_MP3_StreamInfo *info)
{
    if (info)
        *info = streamInfo;
}

void CH32_MP3_RequestStop(void)
{
    stopRequest = 1;
}

/* Caller must have the SD volume mounted (see storage.c). */
CH32_MP3_Status CH32_MP3_PlayFile(const char *path, uint8_t volume)
{
    FIL file;
    HMP3Decoder decoder;
    MP3FrameInfo info;
    const unsigned char *readPtr = inputBuffer;
    const unsigned char *frameStart;
    UINT bytesRead;
    size_t bytesLeft = 0;
    size_t frameBytes;
    uint32_t decodedFrames = 0;
    uint8_t eof = 0;
    uint8_t audioStarted = 0;
    uint8_t slot = 0;
    uint8_t encrypted;
    uint8_t unsupportedStereoSeen = 0;
    uint8_t mpeg1Frame;
    uint8_t streamedGranules;
    uint8_t consecutiveBadFrames = 0;
    uint16_t currentFrameBytes;
    uint16_t dmaWaitMs;
    FSIZE_t readOffset;
    CH32_MP3_Status status = CH32_MP3_OK;
    Audio_InitStatus audioInitStatus;
    int sync;
    int result = 0;

    FaultDiag_SetStage(FAULT_STAGE_MP3_FILE);
    if (!path || f_open(&file, path, FA_READ) != FR_OK) {
        FaultDiag_SetStage(FAULT_STAGE_NONE);
        return CH32_MP3_FILE_ERROR;
    }

    encrypted = IsEncryptedPath(path);
    memset(&streamInfo, 0, sizeof(streamInfo));
    streamInfo.encrypted = encrypted;
    status = PrepareAudioFile(&file, encrypted);
    if (status != CH32_MP3_OK) {
        f_close(&file);
        FaultDiag_SetStage(FAULT_STAGE_NONE);
        return status;
    }
    decoder = MP3InitDecoder();
    if (!decoder) {
        f_close(&file);
        FaultDiag_SetStage(FAULT_STAGE_NONE);
        return CH32_MP3_DECODER_ERROR;
    }

    outputVolume = volume;
    /* Start short announcements at useful level. Audio_PrepareSlot() scans the
     * entire first block and reduces this before DMA if its peak is loud. */
    audioGainQ8 = AUDIO_GAIN_MAX_Q8;
    underflowCount = 0;
    decodedPeak = 0;
    completedDMASlots = 0;
    gapAfterPlayback = 0;
    stopRequest = 0;
    slotState[0] = slotState[1] = 0;
    playingSlot = NO_SLOT;

    while ((!eof || bytesLeft) && !stopRequest) {
        if (!eof && bytesLeft < INPUT_REFILL_LEVEL) {
            FaultDiag_SetStage(FAULT_STAGE_MP3_READ);
            memmove(inputBuffer, readPtr, bytesLeft);
            readOffset = f_tell(&file);
            if (f_read(&file, inputBuffer + bytesLeft,
                       INPUT_BUFFER_SIZE - bytesLeft, &bytesRead) != FR_OK) {
                status = CH32_MP3_SD_READ_ERROR;
                break;
            }
            if (encrypted)
                DecryptBuffer(inputBuffer + bytesLeft, bytesRead, readOffset);
            bytesLeft += bytesRead;
            readPtr = inputBuffer;
            if (bytesRead == 0)
                eof = 1;
        }
        if (bytesLeft < 4)
            break;

        FaultDiag_SetStage(FAULT_STAGE_MP3_SYNC);
        sync = MP3FindSyncWord(readPtr, (int)bytesLeft);
        if (sync < 0) {
            if (eof)
                break;
            if (bytesLeft > 3) {
                readPtr += bytesLeft - 3;
                bytesLeft = 3;
            }
            continue;
        }
        readPtr += sync;
        bytesLeft -= (size_t)sync;

        if (((readPtr[3] >> 6) & 3U) != 3U) {
            /* MP3FindSyncWord checks only the sync bits. Compressed payload or
             * trailing metadata can contain the same pattern, so an
             * unsupported-looking candidate must not terminate a file that
             * otherwise contains valid frames. Advance one byte and resume
             * sync scanning. */
            unsupportedStereoSeen = 1;
            readPtr++;
            bytesLeft--;
            continue;
        }
        if (MP3GetNextFrameInfo(decoder, &info,
                                (unsigned char *)readPtr) != ERR_MP3_NONE) {
            readPtr++;
            bytesLeft--;
            continue;
        }
        currentFrameBytes = Layer3FrameBytes(&info, readPtr);
        if (currentFrameBytes == 0U) {
            readPtr++;
            bytesLeft--;
            continue;
        }
        if (currentFrameBytes > INPUT_BUFFER_SIZE) {
            status = CH32_MP3_FRAME_TOO_LARGE;
            break;
        }
        /* MPEG-1 mono decodes 1152 samples across both contiguous slots. */
        mpeg1Frame = 1;
        dmaWaitMs = 0;
        if (mpeg1Frame) {
            /* The first frame needs both output rows. After audio starts, only
             * row 0 must be free here; the granule hook waits for row 1 just
             * before Helix writes it. */
            while (((audioStarted && slotState[0] != 0) ||
                    (!audioStarted &&
                     (slotState[0] != 0 || slotState[1] != 0))) &&
                   !stopRequest) {
                if (dmaWaitMs++ >= DMA_WAIT_TIMEOUT_MS) {
                    result = -106;
                    break;
                }
                Audio_WaitOneMs();
            }
            slot = 0;
        } else {
            while (slotState[slot] != 0 && !stopRequest) {
                if (dmaWaitMs++ >= DMA_WAIT_TIMEOUT_MS) {
                    result = -106;
                    break;
                }
                Audio_WaitOneMs();
            }
        }
        if (stopRequest || result == -106)
            break;
        frameStart = readPtr;
        frameBytes = bytesLeft;
        FaultDiag_SetStage(FAULT_STAGE_MP3_DECODE);
        streamedGranules = (mpeg1Frame && audioStarted);
        if (streamedGranules) {
            result = MP3DecodeWithGranuleHook(decoder, &readPtr, &bytesLeft,
                pcmBuffer, 0, Audio_GranuleOutputHook, 0);
        } else {
            result = MP3Decode(decoder, &readPtr, &bytesLeft,
                &pcmBuffer[(uint16_t)slot * PCM_SAMPLES_PER_SLOT], 0);
        }
        if (result == ERR_MP3_INDATA_UNDERFLOW && !eof) {
            readPtr = frameStart;
            bytesLeft = frameBytes;
            if (bytesLeft == INPUT_BUFFER_SIZE) {
                /* A verified frame for this build is smaller than the input
                 * buffer. A full-buffer underflow can therefore be a false
                 * sync header whose fields imply a much larger frame. Drop
                 * that candidate byte and resume scanning instead of
                 * misreporting the file as FRAME TOO LARGE. */
                readPtr++;
                bytesLeft--;
            }
            continue;
        }
        if (result == ERR_MP3_OUTPUT_ABORTED) {
            result = stopRequest ? 0 : -106;
            break;
        }
        if (result == ERR_MP3_MAINDATA_UNDERFLOW) {
            consecutiveBadFrames = 0;
            continue;
        }
        if (result != ERR_MP3_NONE) {
            if (audioStarted && ++consecutiveBadFrames >=
                MAX_CONSECUTIVE_BAD_FRAMES) {
                status = CH32_MP3_CORRUPT_FILE;
                break;
            }
            if (readPtr == frameStart && bytesLeft) {
                readPtr++;
                bytesLeft--;
            }
            continue;
        }

