mohammedshahin10/CH32V203_HAPPY-BELL/Firmware/LibHelixMP3/ch32_mp3_player.c
        MP3GetLastFrameInfo(decoder, &info);
        consecutiveBadFrames = 0;
        if (info.layer != 3 || info.version != MPEG1 ||
            info.bitsPerSample != 16 || info.nChans != 1 ||
            info.samprate != 32000 || info.outputSamps != 1152 ||
            (info.bitrate != 64000 && info.bitrate != 128000)) {
            status = CH32_MP3_UNSUPPORTED_FORMAT;
            break;
        }
        decodedFrames++;
        if (!audioStarted) {
            FaultDiag_SetStage(FAULT_STAGE_AUDIO_INIT);
            audioInitStatus = Audio_Init((uint32_t)info.samprate);
            if (audioInitStatus != AUDIO_INIT_OK) {
                status = audioInitStatus == AUDIO_INIT_CLOCK_ERROR ?
                         CH32_MP3_CLOCK_ERROR : CH32_MP3_UNSUPPORTED_RATE;
                break;
            }
            streamInfo.sampleRate = (uint32_t)info.samprate;
            streamInfo.bitrate = (uint32_t)info.bitrate;
            streamInfo.frameBytes = currentFrameBytes;
            streamInfo.samplesPerFrame = (uint16_t)info.outputSamps;
            streamInfo.bitsPerSample = (uint8_t)info.bitsPerSample;
            streamInfo.channels = (uint8_t)info.nChans;
            streamInfo.layer = (uint8_t)info.layer;
            streamInfo.mpegVersion = (uint8_t)info.version;
            audioStarted = 1;
        } else if ((uint32_t)info.samprate != streamInfo.sampleRate ||
                   (uint8_t)info.bitsPerSample != streamInfo.bitsPerSample ||
                   (uint8_t)info.nChans != streamInfo.channels ||
                   (uint8_t)info.layer != streamInfo.layer ||
                   (uint8_t)info.version != streamInfo.mpegVersion ||
                   (uint16_t)info.outputSamps != streamInfo.samplesPerFrame) {
            status = CH32_MP3_CORRUPT_FILE;
            break;
        }
        if (info.outputSamps == (int)(PCM_SAMPLES_PER_SLOT * 2U)) {
            if (!streamedGranules) {
                /* First frame: audio was not initialized when Helix produced
                 * its rows, so prepare and queue both now. Later frames are
                 * handed off granule-by-granule inside the decode call. */
                FaultDiag_SetStage(FAULT_STAGE_PCM_PREPARE);
                Audio_PrepareSlot(0, PCM_SAMPLES_PER_SLOT);
                Audio_PrepareSlot(1, PCM_SAMPLES_PER_SLOT);
                slotCount[0] = slotCount[1] = PCM_SAMPLES_PER_SLOT;
                slotState[0] = slotState[1] = 1;
                FaultDiag_SetStage(FAULT_STAGE_DMA_OUTPUT);
                Audio_StartReadySlot(0);
            }
            slot = 0;
        } else if (info.outputSamps > 0 &&
                   info.outputSamps <= (int)PCM_SAMPLES_PER_SLOT) {
            FaultDiag_SetStage(FAULT_STAGE_PCM_PREPARE);
            Audio_PrepareSlot(slot, (uint16_t)info.outputSamps);
            slotCount[slot] = (uint16_t)info.outputSamps;
            slotState[slot] = 1;
            FaultDiag_SetStage(FAULT_STAGE_DMA_OUTPUT);
            Audio_StartReadySlot(0);
            slot ^= 1U;
        } else {
            status = CH32_MP3_UNSUPPORTED_FORMAT;
            break;
        }
    }

    dmaWaitMs = 0;
    while (!stopRequest && (slotState[0] || slotState[1] || playingSlot != NO_SLOT)) {
        if (dmaWaitMs++ >= DMA_WAIT_TIMEOUT_MS) {
            result = -106;
            break;
        }
        Audio_WaitOneMs();
    }
    CH32_MP3_Stop();
    MP3FreeDecoder(decoder);
    f_close(&file);
    FaultDiag_SetStage(FAULT_STAGE_NONE);

    if (status != CH32_MP3_OK)
        return status;
    if (decodedFrames == 0 && unsupportedStereoSeen)
        return CH32_MP3_UNSUPPORTED_STEREO;
    if (result == -106)
        return CH32_MP3_AUDIO_TIMEOUT;
    if (decodedFrames == 0)
        return encrypted ? CH32_MP3_CORRUPT_FILE : CH32_MP3_DECODER_ERROR;
    return CH32_MP3_OK;
}
